
# Analyzing Work Place Satisfaction Survey Data

This notebook walks through an analysis of workplace satisfaction survey data. The dataset includes demographic variables (such as gender, age, and family status), educational background, years of service, and salary. Additionally, the data captures satisfaction ratings for management, colleagues, the work environment, salary, and job tasks. Other variables indicate whether the respondent has used various company benefits such as healthcare, gym access, holiday cabins, and massage services.

We'll perform data cleaning, explore descriptive statistics, visualize the data, and investigate relationships between variables using cross-tabulation, statistical tests, and visualizations.

## Goals of the analysis:
1.Understand the demographics and job-related attributes of the respondents.
2.Analyze satisfaction levels across different groups, such as gender, education level, and family status.
3.Examine the relationships between satisfaction ratings and variables like salary, years of service, and company benefits.
4.Test for significant relationships between key variables (e.g., satisfaction with management and use of healthcare services).

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


### Initial Preparation
#### Load the data
In this section, we'll start by importing the necessary libraries and loading the data. We'll take an initial look at the dataset to understand its structure and contents.

Here we use the `head()` function to display the first five rows of the dataset, which helps us quickly understand the variables available and how the data is structured.

Use isnull().sum() to check for missing values in each column. This will help in identifying which columns require data cleaning.

In [6]:
#We use `pip install openpyxl` to enable Pandas to read and write Excel files in `.xlsx` format.
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\yayom\appdata\local\programs\python\python312\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\yayom\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
# Open the data
df = pd.read_excel('WorkPlaceSatisfactionSurveyData.xlsx')
df.head()

,number,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks,healtcare,holidayCabin,gym,muscleCare
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN

In [8]:
# Check for missing values in each column
df.isnull().sum()

number                     0
gender                     0
age                        0
family                     0
education                  1
years_of_service           2
salary                     0
sat_management             0
sat_colleques              1
sat_workingEnvironment     0
sat_salary                 0
sat_tasks                  0
healtcare                 35
holidayCabin              62
gym                       73
muscleCare                60
dtype: int64

#### Adjust column names
Step 1:Here we will replace the column names with new names.

Step 2:We will drop unnecessary columns or rows as needed using drop().

In [10]:
#Rrename all columns
df.columns = ['Number ', 'Gender', 'Age','Marital status','Education Level','Service years','Salary','Sat_Management',
              'Sat_Colleques','Sat_WorkEnvironment','Sat_Salary','Sat_Tasks','HealthCare','Holiday Cottage','Gym','MuscleCare']

In [16]:
#Print the table with renamed all columns
df.head()

,Number,Gender,Age,Marital status,Education Level,Service years,Salary,Sat_Management,Sat_Colleques,Sat_WorkEnvironment,Sat_Salary,Sat_Tasks,HealthCare,Holiday Cottage,Gym,MuscleCare
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN

In [18]:
# Print the renamed column names
print(df.columns)

Index(['Number ', 'Gender', 'Age', 'Marital status', 'Education Level',
       'Service years', 'Salary', 'Sat_Management', 'Sat_Colleques',
       'Sat_WorkEnvironment', 'Sat_Salary', 'Sat_Tasks', 'HealthCare',
       'Holiday Cottage', 'Gym', 'MuscleCare'],
      dtype='object')

In [19]:
#Drop unnecessary columns or rows as needed using drop()
df = df.drop(['Number ', 'HealthCare', 'Holiday Cottage', 'Gym', 'MuscleCare'], axis=1)

In [21]:
# Print the column names and table
print(df.columns)
df.head()

Index(['Gender', 'Age', 'Marital status', 'Education Level', 'Service years',
       'Salary', 'Sat_Management', 'Sat_Colleques', 'Sat_WorkEnvironment',
       'Sat_Salary', 'Sat_Tasks'],
      dtype='object')

,Gender,Age,Marital status,Education Level,Service years,Salary,Sat_Management,Sat_Colleques,Sat_WorkEnvironment,Sat_Salary,Sat_Tasks
0,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,1,24,1,2.0,4.0,2183,2,3.0,2,1,2

#### Get summary statistics
Step1:Use commands like info(), describe(), count(), nlargest().

Step2:Loop through variables to explore unique values:for var in df: print(var, df[var].unique())

In [22]:
#info(): Shows a summary of the DataFrame, including how many rows and columns it has, the data types, and if there are any missing values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               82 non-null     int64
 1   Age                  82 non-null     int64
 2   Marital status       82 non-null     int64
 3   Education Level      81 non-null     float64
 4   Service years        80 non-null     float64
 5   Salary               82 non-null     int64
 6   Sat_Management       82 non-null     int64
 7   Sat_Colleques        81 non-null     float64
 8   Sat_WorkEnvironment  82 non-null     int64
 9   Sat_Salary           82 non-null     int64
 10  Sat_Tasks            82 non-null     int64
dtypes: float64(3), int64(8)
memory usage: 7.2 KB

In [24]:
#describe(): Gives basic statistics for numerical columns, like average, minimum, maximum, and how many entries there are.
df.describe()

,Gender,Age,Marital status,Education Level,Service years,Salary,Sat_Management,Sat_Colleques,Sat_WorkEnvironment,Sat_Salary,Sat_Tasks
count,82.000000,82.000000,82.000000,81.000000,80.000000,82.000000,82.000000,81.000000,82.000000,82.000000,82.000000
mean,1.231707,37.951220,1.621951,1.987654,12.175000,2563.878049,3.060976,4.061728,3.219512,2.109756,3.195122
std,0.424519,9.773866,0.487884,0.844006,8.807038,849.350302,1.058155,0.826826,1.154961,1.111179,1.047502
min,1.000000,20.000000,1.000000,1.000000,0.000000,1521.000000,1.000000,2.000000,1.000000,1.000000,1.000000
25%,1.000000,31.000000,1.000000,1.000000,3.750000,2027.000000,2.000000,4.000000,3.000000,1.000000,3.000000
50%,1.000000,37.500000,2.000000,2.000000,12.500000,2320.000000,3.000000,4.000000,3.000000,2.000000,3.000000
75%,1.000000,44.000000,2.000000,3.000000,18.250000,2808.000000,4.000000,5.000000,4.000000,3.000000,4.000000
max,2.000000,61.000000,2.000000,4.000000,36.000000,6278.000000,5.000000,5.000000,5.000000,5.000000,5.000000

In [25]:
#count(): Tells  how many non-empty entries there are in each column, helping to find missing data.
df.count()

Gender                 82
Age                    82
Marital status         82
Education Level        81
Service years          80
Salary                 82
Sat_Management         82
Sat_Colleques          81
Sat_WorkEnvironment    82
Sat_Salary             82
Sat_Tasks              82
dtype: int64

In [26]:
#nlargest(n, 'column_name'): Shows the top n highest values in a specific column (like the highest salaries).
df.nlargest(10, 'Salary')

,Gender,Age,Marital status,Education Level,Service years,Salary,Sat_Management,Sat_Colleques,Sat_WorkEnvironment,Sat_Salary,Sat_Tasks
32,1,59,2,3.0,15.0,6278,4,4.0,5,4,4
16,1,26,1,4.0,2.0,5225,5,5.0,5,4,5
66,1,37,2,4.0,8.0,5069,3,4.0,3,2,2
21,1,47,2,3.0,17.0,4874,2,4.0,3,2,4
23,1,36,1,3.0,7.0,4446,3,4.0,3,4,5
0,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
13,1,58,2,3.0,21.0,3587,4,5.0,4,1,3
22,1,44,2,1.0,27.0,3510,4,4.0,4,4,4
68,1,28,2,2.0,1.0,3510,4,5.0,3,1,4
71,1,46,2,2.0,23.0,3470,3,5.0,5,3,4

In [27]:
# Loop through each column in the DataFrame, prints each column name and its unique values from the DataFrame.
for var in df:
    print(var, df[var].unique())

Gender [1 2]
Age [38 29 30 36 24 31 49 55 40 33 39 35 58 53 42 26 47 44 43 56 21 45 59 37
 28 50 32 51 22 34 27 41 25 61 20 52 46]
Marital status [1 2]
Education Level [ 1.  2.  3.  4. nan]
Service years [22. 10.  7. 14.  4. 16.  0. 23. 21. 15. 12.  2. 17. 20. 13. 27.  1.  3.
 nan 24.  5.  9.  6. 35. 28. 18. 36. 19.  8.]
Salary [3587 2963 1989 2144 2183 1910 2066 2768 2106 2651 2846 2808 3393 2691
 5225 2729 2925 2457 4874 3510 4446 1521 2223 1949 2340 6278 1559 2027
 2300 2534 1872 2261 2417 3119 2574 1715 5069 2495 3470 1598 1638 2612]
Sat_Management [3 1 2 4 5]
Sat_Colleques [ 3.  5.  4.  2. nan]
Sat_WorkEnvironment [3 2 1 5 4]
Sat_Salary [3 1 2 4 5]
Sat_Tasks [3 2 4 1 5]

#### Clean the data by handling missing values and other issues

In [28]:
# Check for missing values in each column
missing_values = df.isnull().sum()
print(missing_values)

Gender                 0
Age                    0
Marital status         0
Education Level        1
Service years          2
Salary                 0
Sat_Management         0
Sat_Colleques          1
Sat_WorkEnvironment    0
Sat_Salary             0
Sat_Tasks              0
dtype: int64

In [29]:
# Only a few data points are missing in the dataset: there is one missing value in the `Education Level` column, 
# two missing values in the `Service years` column, and one missing value in the `Sat_Colleques` column. All other columns have no missing values.

# Fill missing values for 'Education Level' with 'Unknown'
df['Education Level'] = df['Education Level'].fillna('Unknown')

# Fill missing values for 'Service years' with the mean of the column
df['Service years'] = df['Service years'].fillna(df['Service years'].mean())

# Fill missing values for 'Sat_Colleques' with the mean of the column
df['Sat_Colleques'] = df['Sat_Colleques'].fillna(df['Sat_Colleques'].mean())

# Check for missing values again to confirm all are filled
print(df.isnull().sum())

Gender                 0
Age                    0
Marital status         0
Education Level        0
Service years          0
Salary                 0
Sat_Management         0
Sat_Colleques          0
Sat_WorkEnvironment    0
Sat_Salary             0
Sat_Tasks              0
dtype: int64

In [31]:
# Verify there is no missing values in each column
missing_values = df.isnull().sum()
print(missing_values)

Gender                 0
Age                    0
Marital status         0
Education Level        0
Service years          0
Salary                 0
Sat_Management         0
Sat_Colleques          0
Sat_WorkEnvironment    0
Sat_Salary             0
Sat_Tasks              0
dtype: int64